samples/personal-info/out/rdra_whole.puml
@startuml
!theme plain

actor "System Administrator" as SysAdmin
actor "User" as User

usecase "Change Password" as ChangePassword
usecase "Delete Address" as DeleteAddress
usecase "Delete Card" as DeleteCard
usecase "List Cards" as ListCards
usecase "Register Address" as RegisterAddress
usecase "Register Card" as RegisterCard
usecase "Request Password Reset" as RequestPasswordReset
usecase "Reset Password" as ResetPassword
usecase "Set Initial Password" as SetInitialPassword
usecase "Set Primary Address" as SetPrimaryAddress
usecase "Set Primary Card" as SetPrimaryCard
usecase "Update Address" as UpdateAddress
usecase "Update Personal Information" as UpdateProfile
usecase "View Personal Information" as ViewProfile

rectangle "Manage Credit Cards" as BucCard
rectangle "Manage Password" as BucPassword
rectangle "Manage Personal Information" as BucProfile

package "Personal Data System" as PersonalDataSystem


database "Audit Log" as AuditLog
database "Credit Card" as CreditCard
database "Password Credential" as PasswordCredential
database "Personal Information" as PersonalInfo
database "Postal Address" as PostalAddress
database "User Account" as UserAccount

boundary "Address Edit Screen" as AddressEditScreen
boundary "Address List Screen" as AddressListScreen
boundary "Card Registration Screen" as CardAddScreen
boundary "Card List Screen" as CardListScreen
boundary "Password Change Screen" as PasswordChangeScreen
boundary "Password Reset Screen" as PasswordResetScreen
boundary "Password Setup Screen" as PasswordSetScreen
boundary "Personal Information Screen" as ProfileScreen

control "Restore Account" as Active
control "Delete Account" as Deleted
control "Suspend Account" as Suspended

collections "Active" as Active
collections "Deleted" as Deleted
collections "Suspended" as Suspended

User --> BucProfile
User --> BucCard
User --> BucPassword
BucProfile ..> PersonalDataMgmt : belongs
BucProfile ..> ViewProfile : contains
BucProfile ..> UpdateProfile : contains
BucProfile ..> RegisterAddress : contains
BucProfile ..> UpdateAddress : contains
BucProfile ..> DeleteAddress : contains
BucProfile ..> SetPrimaryAddress : contains
BucCard ..> PersonalDataMgmt : belongs
BucCard ..> SetPrimaryCard : contains
BucCard ..> ListCards : contains
BucCard ..> RegisterCard : contains
BucCard ..> DeleteCard : contains
BucPassword ..> PersonalDataMgmt : belongs
BucPassword ..> SetInitialPassword : contains
BucPassword ..> ChangePassword : contains
BucPassword ..> RequestPasswordReset : contains
BucPassword ..> ResetPassword : contains
PersonalInfo -- UserAccount
PostalAddress -- UserAccount
CreditCard -- UserAccount
PasswordCredential -- UserAccount
AuditLog -- UserAccount
SetPrimaryCard ..> CardListScreen : displays
SetInitialPassword ..> PasswordSetScreen : displays
ChangePassword ..> PasswordChangeScreen : displays
RequestPasswordReset ..> PasswordResetScreen : displays
ResetPassword ..> PasswordResetScreen : displays
ViewProfile ..> ProfileScreen : displays
UpdateProfile ..> ProfileScreen : displays
RegisterAddress ..> AddressEditScreen : displays
UpdateAddress ..> AddressEditScreen : displays
DeleteAddress ..> AddressListScreen : displays
SetPrimaryAddress ..> AddressListScreen : displays
ListCards ..> CardListScreen : displays
RegisterCard ..> CardAddScreen : displays
DeleteCard ..> CardListScreen : displays
@enduml
